Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: གང་ཡང་ཚུལ་བཞིན་མི་ལྡན་དེ་དག་ལ། །
en: For those who lack any propriety,

source: མངོན་པར་ཤེས་དང་ཐར་པ་ནམ་ཡང་མེད། །
en: There will never be superknowledge or liberation.

source: དེ་དག་ཕྱིན་ཅི་ལོག་དང་ལྡན་པ་དང་། །
en: “ ‘To those who are encumbered by being mistaken,

source: མཐར་ཞེན་ཡང་དག་མ་ཡིན་ཆགས་རིག་ནས། །
en: Who cling to extremes and hold on to what is unreal,

source: ཆོས་རྣམས་འདི་དག་རྣམ་པར་སྤང་བའི་ཕྱིར། །རྒྱལ་བ་དབང་པོ་བྱམས་པས་འཆད་པ་མཛད། །
en: The victorious lords teach out of benevolence So that these beings may know and abandon those factors.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་འཕགས་པའི་ངེས་པར་འབྱུང་བའི་ལམ་ནི་དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བའི་འཕགས་པའི་ངེས་པར་འབྱུང་བའི་ལམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏེདེ་ལ་བསྟེན་ན་སེམས་ཅན་རྣམས་ངེས་པར་འབྱུང་བ་དེ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གང་གིས་ཀྱང་འདི་ངེས་པར་འབྱུང་བའི་ལམ་མ་ཡིན་ནོ་ཞེས་ཆོས་དང་འཐུན་པས་དེ་བཞིན་གཤེགས་པ་ལ་རྒོལ་མི་ནུས་སོ། །
en: (14) “Son of noble family, the tathāgatas know, in accordance with reality, the noble path of deliverance as a noble path of deliverance, which eliminates created suffering. Beings will be delivered if they rely on it, and no one in the world with its gods is able to reasonably reprove the tathāgatas, saying, ‘This is not a path of deliverance.’

source: ངེས་པར་འབྱུང་བའི་ལམ་གང་ཞེ་ན།
en: What, then, is the path of deliverance?

source: འདི་ལྟ་སྟེ། སེམས་ཅན་རྣམས་རྣམ་པར་དག་པར་འགྱུར་བའི་བགྲོད་པ་གཅིག་པུའི་ལམ་མོ། །
en: It is the single path for sentient beings to travel that leads to purification.

source: ངེས་པར་འབྱུང་བའི་ལམ་གྱི་ཆོས་གཉིས་ཏེ། གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཞི་གནས་དང་། ལྷག་མཐོང་ངོ་། །
en: “There are two factors of the path of deliverance: tranquil abiding and special insight.

source: ངེས་པར་འབྱུང་བའི་ལམ་གྱི་ཆོས་གསུམ་སྟེ། གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་སྟེ། གསུམ་པོ་འདི་དག་གོ། །
en: There are three: emptiness, signlessness, and wishlessness.

source: ངེས་པར་འབྱུང་བའི་ལམ་གྱི་ཆོས་བཞི་སྟེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་སུ་གཏོགས་པའི་དྲན་པ་དང་། ཚོར་བར་གཏོགས་པ་དང་། སེམས་སུ་གཏོགས་པ་དང་། ཆོས་སུ་གཏོགས་པའི་དྲན་པ་སྟེ།
en: There are four factors of the path of deliverance: mindfulness of body, mindfulness of feeling, mindfulness of mind, and mindfulness of phenomena.

source: དེ་ལ་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཕྱིའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ནང་དང་ཕྱིའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་།
en: There are applications of mindfulness of the body where one contemplates what is inside the body, what is on the outside of the body, and both together.

source: ནང་གི་ཚོར་བ་དང་། ཕྱིའི་ཚོར་བ་དང་། ནང་དང་ཕྱིའི་ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་།
en: There are applications of mindfulness of sensation where one contemplates inner sensations, outer sensations, and both together.

source: ནང་གི་སེམས་དང་། ཕྱིའི་སེམས་དང་། ནང་དང་ཕྱིའི་སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་།
en: There are applications of mindfulness of mind where one contemplates the introverted mind, the extroverted mind, and both together.

source: ནང་གི་ཆོས་དང་། ཕྱིའི་ཆོས་དང་། ནང་དང་ཕྱིའི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྟེ།
en: Finally, there are applications of mindfulness of phenomena where one contemplates inner factors, outer factors, and both together.

source: ངེས་པར་འབྱུང་བའི་ལམ་གྱི་ཆོས་ལྔ་སྟེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ། ལྔ་པོ་འདི་དག་གོ། །
en: There are five factors of the path of deliverance: the spiritual faculties of faith, vigor, mindfulness, meditative absorption, and insight.

source: ངེས་པར་འབྱུང་བའི་ལམ་གྱི་ཆོས་དྲུག་སྟེ། དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་སྟེ་དྲུག་པོ་འདི་དག་གོ། །
en: There are six factors of the path of deliverance: the recollection of the Buddha, the Dharma, the Saṅgha, renunciation, morality, and the gods.

source: ངེས་པར་འབྱུང་བའི་ལམ་གྱི་ཆོས་བདུན་ཏེ། བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྟེ། བདུན་པོ་འདི་དག་གོ། །
en: There are seven factors of the path of deliverance: the factors of awakening, which are correct mindfulness, correct investigation of phenomena, correct vigor, correct joy, correct pliancy, correct meditative absorption, and the factor of awakening that is correct equanimity.

source: ངེས་པར་འབྱུང་བའི་ལམ་གྱི་ཆོས་བརྒྱད་དེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ། བརྒྱད་པོ་འདི་དག་གོ། །
en: There are eight factors of the path of deliverance: correct view, correct intention, correct speech, correct action, correct livelihood, correct effort, correct mindfulness, and correct meditative absorption.

source: ངེས་པར་འབྱུང་བའི་ལམ་གྱི་ཆོས་དགུ་སྟེ། དགུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བསམ་གཏན་དང་པོ་དང་། བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པའི་སྙོམས་པར་འཇུག་པ་སྟེ། དགུ་པོ་འདི་དག་གོ། །
en: There are nine factors of the path of deliverance: the first, second, third, and fourth concentrations, the attainments of the absorptions of infinite space, consciousness, nothingness, and neither perception nor nonperception, and the attainment of the cessation of perception and feeling.

source: ངེས་པར་འབྱུང་བའི་ལམ་གྱི་ཆོས་བཅུ་སྟེ།
en: There are ten factors of the path of deliverance.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are they?

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་སོ། །
en: They are the ways of the ten virtuous actions.

source: དེ་དག་ཀྱང་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these?

source: སྲོག་གཅོད་པ་སྤོང་བ་དང་། མ་བྱིན་པར་ལེན་པ་སྤོང་བ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་སྤོང་བ་དང་། བརྫུན་དུ་སྨྲ་བ་སྤོང་བ་དང་། ཕྲ་མ་སྤོང་བ་དང་། ངག་རྩུབ་པོ་སྤོང་བ་དང་། ཚིག་ཀྱལ་པ་སྤོང་བ་དང་། བརྣབ་སེམས་སྤོང་བ་དང་། གནོད་སེམས་སྤོང་བ་དང་། ལོག་པར་ལྟ་བ་སྤོང་བ་སྟེ།
en: They are giving up killing, stealing, sexual misconduct, lying, slander, harsh words, idle chatter, covetousness, maliciousness, and wrong views.

source: ངེས་པར་འབྱེད་པའི་ལམ་གྱི་ཆོས་བཅུ་པོ་འདི་དག་གོ། །
en: These are the ten factors that constitute the path of deliverance.

source: དེ་ལྟར་ཇི་ཙམ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་དགེ་བ་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་ལྡན་པའམ། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་ལྡན་པའམ། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་ལྡན་པའམ། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་ལྡན་པའམ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དང་ལྡན་པའམ། འཕགས་པའི་བདེན་པ་དང་ལྡན་པ་དེ་ཡང་ངེས་པར་འབྱུང་བའི་ལམ་ཞེས་བྱའོ། །
en: “Thus, the virtuous factors of awakening, whether they belong to the category of moral conduct, meditative absorption, or insight, or whether they belong to the category of liberation, the insight of liberating wisdom, or the noble truths, are said to constitute the path of deliverance.

source: གཞན་ཡང་ངེས་པར་འབྱུང་བའི་ལམ་ཞེས་བྱ་བ་ནི་གང་ཡང་ཡང་དག་པར་སྒྲུབ་པའོ། །
en: “Moreover, the path of deliverance is to be correctly accomplished.

source: ཡང་དག་པར་སྒྲུབ་པ་གང་ཡིན་པ་དེ་ལ་ནི་སོགས་པའམ། མི་སོགས་པའམ། བླང་བའམ། དོར་བའམ། གཟུང་བའམ། སྤོང་བའི་ཆོས་གང་ཡང་མེད་དོ། །
en: Correct accomplishment is the absence of the factors of accumulating or not accumulating, accepting or rejecting, and appropriating or abandoning.

source: ཡང་དག་པར་ཞུགས་པ་ནི་གཉིས་ལ་བློ་མི་འཇུག་སྟེ།
en: The correct approach is not to engage the mind in duality.

source: ཆོས་ཐམས་ཅད་གཉིས་སུ་མེད་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡེ་ཤེས་ཀྱིས་མཐོང་བ་ནི་ངེས་པར་འབྱུང་བའི་ལམ་སྟེ།
en: “Seeing with wisdom all phenomena in a nondual manner and in accordance with reality is the path of deliverance.

source: དེ་བཞིན་གཤེགས་པ་ངེས་པར་འབྱུང་བའི་ལམ་དེ་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པར་སྟོན་ཏོ། །
en: The tathāgatas teach this path of deliverance to sentient beings.

source: དེ་ལ་སྟེན་ན། དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་འགྱུར་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ངེས་པར་འབྱུང་སྟེ།
en: When they rely on it, sentient beings are delivered, since created suffering is truly eliminated.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅུ་བཞི་པའོ། །
en: This is the fourteenth tathāgata activity of the tathāgatas.

source: གང་སྦྱངས་བདེ་བ་ཚད་མེད་འགྱུར་བ་དང་།
en: “ ‘Those who have been purified will gain immeasurable bliss.

source: གང་བསྟེན་པས་ན་མིས་ནི་ཞི་རིག་པ། །
en: If people rely on this path, they will experience peace.

source: ཐམས་ཅད་རྒྱལ་བས་མཁྱེན་ཏེ་
en: The victors know all.

source: རང་ཐོས་ཤིང་། །མཁྱེན་ནས་འཆི་མེད་འགྲོ་བའི་ཆོས་སྟོན་ཏོ། །
en: Learning and knowing by themselves, they teach the Dharma that leads to immortality.

source: རྒྱལ་བས་བསྔགས་པ་དགེ་བ་བྱང་ཆུབ་ཕྱོགས། །
en: “ ‘If they attend to the virtues conducive to awakening, which are praised by the victors,

source: དགེ་ཆོས་མང་པོ་ཇི་སྙེད་ཡོད་པ་དག །
en: All the many virtuous factors that there are,

source: བློ་གྲོས་ཅན་གྱིས་བསྟེན་ན་མི་འགྲོལ་བའི། །གནས་མེད་ཅེས་ནི་བདེ་བར་གཤེགས་པས་བཤད། །
en: There is no way for the intelligent Not to be liberated—so the Sugata has explained.

source: ཡང་དག་ཆོས་ལ་མཁས་དང་ཡང་དག་ལྡན། །
en: “ ‘Those who are skilled in the true Dharma

source: ཚུལ་བཞིན་གྱིས་ནི་ཉོན་མོངས་རྒྱ་ཆེན་ཞི། །
en: Will pacify the mass of afflictive emotions accordingly.

source: ཆོས་མིན་མ་ཞེན་ཆོས་ལའང་མ་ཡིན་པ། །
en: Without clinging to non-Dharma or even to Dharma,

source: དེ་ནི་རྣམ་གྲོལ་ནད་མེད་ཞི་ལ་རེག །
en: They will reach the peace of liberation that is free from all ills.

source: རྟེན་ལ་མཁས་པ་གང་ཞིག་ཆོས་རྣམས་ལ། །
en: “ ‘Those who are skilled in the support consider that phenomena

source: གསོབ་གསོག་ཡ་མ་བརླ་དང་མཁའ་འདྲ་དང་། །
en: Are deceptive and fake and are like space—

source: སྒྱུ་མའི་གཟུགས་མཚུངས་རྨི་ལམ་འདྲར་རྟོག་པ། །
en: They are like illusory forms and dreams.

source: དེ་ནི་སྲིད་པའི་མཚོ་ལས་ཐར་བར་འགྱུར། །
en: Thus they are liberated from the ocean of existence.

source: འདི་ནི་དྲང་སྲོང་རྒྱལ་པོ་ཐུབ་པའི་ལས། །
en: “ ‘The activity of the kings of sages, the capable ones,

source: སྙིང་རྗེ་བསྐྱེད་ནས་སྐྱེ་བོ་མྱོས་པ་དང་། །
en: Once they have generated compassion,

source: གང་ཕྱིར་སྲིད་པའི་འཁོར་ལོ་ལས་འགྲོལ་བ། །
en: Serves to liberate crazed beings from the wheel of existence.

source: དེ་ཕྱིར་དེ་དག་འདྲེ་བ་མེད་པ་ཡིན། །
en: Therefore they are uncorrupted.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གང་གི་ཕྱིར་དེའི་ལུས་འཁྲུལ་བས་བྱིས་པའམ། མཁས་པས་ཀྱང་རུང་སྟེ། ཆོས་དང་འཐུན་པས་རྒོལ་བར་འགྱུར་བའི་འཁྲུལ་པ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། །
en: (15) “Moreover, son of noble family, the tathāgatas are without bodily faults that could be reasonably objected to, such as the bodily faults that the immature or even the learned may possess.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་སྐུའི་འཕྲིན་ལས་འཁྲུལ་པ་མེད་པ་དང་ལྡན་པ་སྟེ།
en: The physical activity of the blessed buddhas is faultless.

source: ཀུན་དུ་གཟིགས་པ་དང་། རྣམ་པར་གཟིགས་པ་དང་། བསྐུམ་པ་དང་། སྨྱང་བ་དང་། ཆོས་གོས་སྣམ་སྦྱར་དང་། ཐང་བ་དང་། ལྷུང་བཟེད་དང་། ཆོས་གོས་ཐོགས་པས་སྤྱོད་ལམ་མཛེས་པ། བཞུད་པ་དང་། བྱོན་པ་དང་། འཆག་པ་དང་། བཞེངས་པ་དང་། བཞུགས་པ་དང་། གཟིམས་པ་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དུ་འཇུག་པ་དང་། འབྱུང་བ་ན་ཞབས་ཀྱི་མཐིལ་ས་ལ་མི་རེག་སྟེ
en: They display beautiful comportment as they survey the world and behold their surroundings, when they bend and stretch their limbs, as they wear the religious garments consisting of the upper Dharma robe, the outer robe, and the lower robe, and as they hold the alms bowl. The soles of their feet do not touch the ground as they come and go, walk and stand, and sit and recline, or as they enter and depart houses, towns, and hamlets.

source: འཁོར་ལོ་རྩིབས་སྟོང་པ་ས་ལས་འབྱུང་ཞིང་དྲི་ཡིད་དུ་འོང་བའི་པད་མ་མངོན་པར་འབྱུང་སྟེ། དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཞབས་འཇོག་གོ། །
en: Instead, the tathāgatas’ feet step on thousand-spoked wheels that appear out of the ground, and on the lotus flowers with sweet fragrance that emerge.

source: དེ་ལ་གང་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་རེག་པ་དེ་དག་ཞག་བདུན་རབ་ཏུ་བདེ་བ་དང་ལྡན་པར་འགྱུར་རོ། །
en: Those sentient beings, born as animals, who touch the tathāgatas’ footprints experience bliss for a week.

source: ཤི་འཕོས་ན་ཡང་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: After death, they will be reborn in the happy destinies of the higher realms.

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ཆོས་གོས་སོར་བཞི་ཙམ་གྱིས་མི་རེག་མོད་ཀྱི། རྣམ་པར་འཐོར་རླུང་གི་རླུང་གིས་ཀྱང་བཟློག་པར་མི་ནུས་སོ། །
en: The tathāgatas’ religious garments do not actually touch their bodies by four finger lengths, but even so, a fierce wind will fail to make them disheveled.

source: སྐུའི་འོད་ཀྱིས་མནར་མེད་པའི་བར་གྱི་སེམས་ཅན་བདེ་བར་བྱེད་དེ།
en: The radiance of their bodies arouses bliss in sentient beings as far as the lowest hell.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་འཁྲུལ་པ་མེད་ཅེས་བྱའོ། །
en: Therefore, the bodies of the tathāgatas are said to be faultless.

source: རིགས་ཀྱི་བུ་ཡང་གང་གི་ཕྱིར་དེའི་གསུང་གི་འཁྲུལ་པས་བྱིས་པའམ་མཁས་པས་ཀྱང་རུང་སྟེ། ཆོས་དང་འཐུན་པས་རྒོལ་བར་འགྱུར་བའི་གསུང་གི་འཁྲུལ་པ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། །
en: “Son of noble family, the tathāgatas are without verbal faults that could be reasonably objected to, such as the verbal faults that the immature or even the learned may possess.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་དུས་སུ་གསུང་བ། ཚིགས་སུ་གསུང་བ། ཡང་དག་པར་གསུང་བ། བདེན་པར་གསུང་བ། ཇི་སྐད་གསུངས་པ་དེ་བཞིན་དུ་མཛད་པའོ། །
en: Because, son of noble family, their speech is timely, poetic, correct, and truthful, and they act accordingly.

source: ཤིན་ཏུ་ངེས་པའི་ཚིག་དང་ལྡན་པའོ། །སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པའི་ཚིག་དང་ལྡན་པའོ། །
en: Their words are precisely defined and satisfy all sentient beings.

source: མི་ཟློས་པའི་ཚིག་དང་ལྡན་པའོ། །
en: They are not repetitive.

source: དོན་དང་ཚིག་འབྲུས་བརྒྱན་པའི་ཚིག་དང་ལྡན་པའོ། །
en: They are adorned with beautiful phrases and meaning.

source: སྐད་ཅིག་བརྗོད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཚིམ་པར་བྱེད་པ་སྟེ།
en: A single instant of expression satisfies the minds of all sentient beings.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་གསུང་འཁྲུལ་པ་མེད་ཅེས་བྱའོ། །
en: Therefore, the speech of the tathāgatas is said to be faultless.

source: རིགས་ཀྱི་བུ་ཡང་གང་གི་ཕྱིར་དེའི་ཐུགས་འཁྲུལ་པས་བྱིས་པའམ། མཁས་པས་ཀྱང་རུང་སྟེ། ཆོས་དང་འཐུན་པས་རྩོད་པར་འགྱུར་བའི་སེམས་ཀྱི་འཁྲུལ་པ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། །
en: “Son of noble family, the tathāgatas are without mental faults that could be reasonably objected to, such as the mental faults that the immature or even the learned may possess.

source: འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ནི་མཉམ་པར་གཞག་པའི་གནས་མི་འདོར་ཞིང་སངས་རྒྱས་ཀྱི་མཛད་པ་ཐམས་ཅད་མཛད་ཀྱང་སེམས་དེར་མི་གཏོང་ཞིང་ཆོས་ཐམས་ཅད་ལ་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་མཐོང་བ་འཇུག་སྟེ
en: Because even though they perform all the buddha deeds without abandoning the state of equipoise, the tathāgatas apply their unattached vision of wisdom to all phenomena without abandoning the mind in equipoise.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སེམས་འཁྲུལ་པ་མེད་ཅེས་བྱའོ། །
en: Therefore, the tathāgata mind is said to be faultless.

source: ཇི་ལྟར་དེའི་སེམས་འཁྲུལ་པ་མེད་པ་དེ་བཞིན་དུ་འཁྲུལ་པ་ཐམས་ཅད་སེལ་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: Just as their mind is faultless, they teach the Dharma accordingly to beings in order to dispel all their faults.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅྭ་ལྔ་པའོ། །
en: This is the fifteenth tathāgata activity of the tathāgatas.

source: སྐུ་དང་གསུང་དང་ཐུགས་ཀྱི་འཁྲུལ་པ་དག །རྣམ་པར་འདྲེན་ལ་ཅུང་ཟད་ཡོད་མ་ཡིན། །
en: “ ‘The guides of beings are without the slightest Physical, verbal, or mental faults.

source: འཇིག་རྟེན་མགོན་པོ་ཁ་ན་མ་ཐོ་མེད། །
en: The world protectors are without wrongdoing.

source: འཁྲུལ་མེད་འགྲོ་ལ་ཕན་བྱེད་ཀུན་ནས་གཟིགས། །
en: They look faultlessly at all the ways to benefit beings.

source: ཇི་ལྟར་རྒྱལ་བ་ཅུང་ཟད་འཁྲུལ་མེད་པ། །
en: “ ‘Thus the victors are without the slightest fault,

source: དེ་ལྟར་ཆོས་མཆོག་ཞི་བ་འགྲོ་ལ་སྟོན། །
en: And they teach the supreme Dharma of peace to beings.

source: འཁྲུལ་པ་འདི་དག་ཐམས་ཅད་རྣམ་སྤངས་པ། །
en: The complete abandonment of all those faults

source: འདི་ནི་རྒྱལ་བའི་འཕྲིན་ལས་བཅྭ་ལྔ་པ། །
en: Is the fifteenth activity of the victors.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེའི་ཅ་ཅོ་གང་ལས་བདུད་དམ། བདུད་ཀྱི་རིས་ཀྱི་ལྷའམ། གཞན་མུ་སྟེགས་ཅན་དག་གིས་གླགས་རྙེད་པར་འགྱུར་བའི་ཅ་ཅོ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། །
en: (16) “Son of noble family, the tathāgatas have no noisy kinds of speech that could lead to conflict, such as the noisy speech of Māra, the class of māras, or the non-Buddhists.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཅ་ཅོ་འམ་རྗེས་སུ་ཅ་ཅོ་མེད་དོ། །
en: Because the tathāgatas do not speak noisily or raucously.

source: དེ་བཞིན་གཤེགས་པ་ནི་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བ་སྟེ།
en: Because they are free of attachment and anger.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བཀུར་སྟི་བྱས་ཀྱང་མ་ཐོས་པར་མི་སེམས། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བཀུར་སྟི་མ་བྱས་ཀྱང་སྲོ་ཤི་བར་མི་འགྱུར་རོ། །
en: They do not become elated when all beings revere them, nor do they become disheartened if no beings revere them.

source: གང་གི་ཕྱིར་དེ་འགྱོད་པས་རྗེས་སུ་ཅ་ཅོ་འབྱུང་བར་འགྱུར་བ་བྱ་དཀའ་བའི་བྱ་བའམ། མཐར་མ་ཕྱིན་པ་ཅུང་ཟད་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། །
en: They do not babble regretfully about tasks that were difficult or could not be completed.

source: དེ་བཞིན་གཤེགས་པ་ནི་འཇིག་རྟེན་གང་དང་ཡང་རྩོད་པ་མ་ཡིན་ཏེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཅ་ཅོ་མེད་དོ། །
en: “Tathāgatas do not dispute about anything in the world; they do not grumble.

source: དེ་བཞིན་གཤེགས་པ་ནི་ཉོན་མོངས་པ་མེད་པ་ལ་གནས་པ་སྟེ།
en: They abide in the absence of afflictive emotions.

source: ངའི་བ་མེད་པ། ཡོངས་སུ་འཛིན་པ་མེད་པ། ལེན་པ་མེད་པ། མདུད་པ་ཐམས་ཅད་དང་བྲལ་བ་སྟེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ལ་ཅ་ཅོ་མེད་དོ། །
en: They are not possessive, they do not cling to or appropriate anything, and they are free from all bonds, so they do not speak noisily.

source: ཇི་ལྟར་དེ་ལ་ཅ་ཅོ་མེད་པ་དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཅ་ཅོ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: Just as their speech is not noisy, they teach the Dharma accordingly, so that all the noisy speech of all sentient beings will be abandoned.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅུ་དྲུག་པའོ། །
en: This is the sixteenth activity of the tathāgatas.

source: བསྔགས་པ་ཐོས་ཀྱང་མ་ཐོས་པར་སེམས་པ་མེད། །
en: “ ‘When hearing praise, they are not elated.

source: མི་བསྔགས་ཐོས་ཀྱང་སྲོ་ཤིར་མི་འགྱུར་ཏེ། །
en: When hearing blame, they are not disheartened.

source: རྗེས་སུ་འཆགས་དང་ཁོང་ཁྲོར་འགྱུར་བ་མེད། །
en: They have no attachment or anger.

source: སྔོན་སྤྱོད་ལེགས་པར་སྤྱད་པ་སྨད་པ་མིན། །
en: They do not belittle previous actions that were well performed.

source: རྒྱལ་བས་ཉོན་མོངས་མེད་པ་རྟག་ཏུ་བསྒོམས། །
en: “ ‘The victors constantly cultivate the absence of afflictive emotions.

source: དེ་ལ་ང་ཡི་མེད་ཅིང་འཛིན་མདུད་མེད། །
en: They lack possessiveness, clinging, or bonds.

source: ཇི་ལྟར་གནས་པ་དེ་ལྟར་ཆོས་སྟོན་ཏེ། །
en: They teach in accord with their manner of abiding.

source: འདི་ནི་བདེན་པ་མཐོང་བའི་ལམ་གྱི་མཆོག །
en: That is the excellence of the path on which one sees the truth.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བསྙེལ་བ་གང་གིས་ཆོས་གང་ལ་ཡང་རྨོངས་པར་འགྱུར་བའི་བསྙེལ་བ་དེ་བཞིན་གཤེགས་པ་ལ་མེད་དོ། །
en: (17) “Son of noble family, the tathāgatas do not suffer from forgetfulness that could lead to confusion about any phenomena.

source: དེ་བཞིན་གཤེགས་པ་ནི་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ལ་བསྙེལ་བ་མེད་དོ། །
en: Because none of the concentrations, liberations, absorptions, or meditative attainments of the tathāgatas are marred by forgetfulness.

source: དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དང་། གཡོ་བ་ལ་རྣམ་པར་ལྟ་ཞིང་སོ་སོ་ཅི་རིགས་པར་ཆོས་སྟོན་པ་ལ་བསྙེལ་བ་མེད་དོ། །
en: When the tathāgatas observe the activity and movement of the minds of all sentient beings and teach the Dharma that is suitable for each, they do not suffer from forgetfulness.

source: དེ་བཞིན་གཤེགས་པ་ནི་དོན་དང་། ཆོས་དང་། ངེས་པའི་ཚིག་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་ལ་བསྙེལ་བ་མེད་དོ། །
en: The tathāgatas do not suffer from forgetfulness regarding the discriminations of meaning, phenomena, etymologies, and eloquence.

source: དེ་བཞིན་གཤེགས་པ་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་ལ་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་ལ་བསྙེལ་བ་མེད་དོ། །
en: They do not suffer from forgetfulness in their unattached vision of wisdom of the past, present, and future.

source: དེ་བཞིན་གཤེགས་པ་ཇི་ལྟར་བདག་བསྙེལ་བ་མེད་པ་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་བརྗེད་པར་མི་འགྱུར་བར་ཆོས་སྟོན་ཏེ།
en: “Just as the tathāgatas do not suffer from forgetfulness themselves, they teach the Dharma accordingly, so that no sentient beings will suffer from forgetfulness.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅུ་བདུན་པའོ། །
en: This is the seventeenth tathāgata activity of the tathāgatas.

source: ཆོས་དང་ཡེ་ཤེས་རྣམ་ཐར་སྤྱོད་ཡུལ་ལ། །རྣམ་པར་འདྲེན་པ་བསྙེལ་བ་མེད་པ་སྟེ། །
en: “ ‘The guides do not suffer from forgetfulness regarding phenomena Or in their wisdom, liberations, or fields of activity.

source: བསམ་པ་ཇི་བཞིན་ཆོས་རྣམས་བསྟན་པའི་ཕྱིར། །
en: They teach the dharmas that correspond to mentalities,

source: སེམས་ཅན་བསམ་པ་རྣམས་ལ་སྤྱོད་མཐའ་ཡས། །
en: Since the activity in the minds of sentient beings is endless.

source: སོ་སོ་ཡང་དག་རིག་ལ་བསྙེལ་བ་མེད། །
en: “ ‘Their discriminating knowledge is not marred by forgetfulness.

source: དུས་གསུམ་ལ་ནི་ཡེ་ཤེས་བསྒྲིབས་པ་མེད། །
en: Their wisdom is unobscured with respect to the three times.

source: ཇི་ལྟར་མི་བསྙེལ་དེ་ལྟར་ཆོས་སྟོན་ཏེ། །
en: Just as they are without forgetfulness, so do they teach the Dharma accordingly.

source: འདི་ནི་སྐྱེས་མཆོག་རྣམས་ཀྱི་འཕྲིན་ལས་ཡིན། །
en: This is the activity of supreme beings.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་སེམས་མཉམ་པར་མ་བཞག་པ་མེད་དོ། །
en: (18) “Son of noble family, the minds of the tathāgatas are never not in equipoise.

source: དེ་བཞིན་གཤེགས་པ་ནི་འཆག་གམ། བཞེངས་སམ། བཞུགས་སམ། གཟིམས་སམ། བཤོས་གསོལ་ལམ། གསུང་ངམ། ཅང་མི་གསུང་ཡང་རུང་སྟེ། རྟག་ཏུ་མཉམ་པར་བཞག་པ། ཏིང་ངེ་འཛིན་ཟབ་མོའི་མཆོག་ཐོབ་པ། སྒྲིབ་པ་མེད་པའི་བསམ་གཏན་ལ་བསམ་གཏན་བྱེད་པ་སྟེ།
en: Whether they walk, stand, sit, or recline, whether they eat, speak, or remain silent, they are constantly in equipoise, attain the supremely profound absorption, and practice an unobscured type of concentration.

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་མ་གཏོགས་པར་སེམས་ཅན་གྱི་རིས་ན་སེམས་ཅན་གང་མཉམ་པར་བཞག་ཀྱང་རུང་མཉམ་པར་མ་བཞག་ཀྱང་རུང་སྟེ། སུ་ཡང་དེ་བཞིན་གཤེགས་པའི་སེམས་ལ་ལྟ་བར་ནུས་པ་མེད་དོ། །
en: Without the blessing of the tathāgatas, no one among beings, whether in equipoise or not, is able to observe the mind of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཇི་ལྟར་རྟག་ཏུ་མཉམ་པར་གཞག་པ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་རྣམས་ཏིང་ངེ་འཛིན་ལས་མི་གཡེང་བར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏེ།
en: “Just as the tathāgatas are constantly in equipoise, they teach the Dharma accordingly, in order that sentient beings will not become distracted from their absorptions.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅྭ་བརྒྱད་པའོ། །
en: This is the eighteenth tathāgata activity of the tathāgatas.

source: བཞེངས་སམ་བཞུགས་སམ་གཟིམས་སམ་འཆག་པ་རྣམས་སུ་ཡང་། །སངས་རྒྱས་སེམས་ནི་མཉམ་པར་མ་བཞག་ནམ་ཡང་མེད། །
en: “ ‘Whether standing, sitting, lying down, or moving about, The buddhas are without a mind that is not in equipoise.

source: མི་གསུང་བཞུགས་དང་གསུང་བ་དང་ནི་བཤོས་གསོལ་དང་། །རྒྱལ་བ་མཉམ་པར་བཞག་ལ་གཡེང་བ་མི་དམིགས་སོ། །
en: Whether sitting silently, speaking, or eating, The victors are never seen to waver in their equipoise.

source: གང་ཞིག་བདེ་གཤེགས་མཉམ་པར་བཞག་པའི་སེམས་ཤེས་པ། །གང་ཟག་དེ་ནི་ཕྱོགས་བཅུ་དག་ནའང་ཡོད་མ་ཡིན། །
en: “ ‘There is no one in the ten directions Who can know the mind of a sugata in equipoise.
